[
  {
    "Id": "291926",
    "ThreadId": "85721",
    "Html": "<p>Greetings to you all,</p>\r\n<p>&nbsp;</p>\r\n<p>I am a student currently studying at Bournemouth University. I have decided for my project that I will attempt to use the Touchless SDK to create a Silverlight based UML modelling tool. &nbsp;Hopefully, if things go well, I will be able to make this a collaborative tool but only if there is time.</p>\r\n<p>&nbsp;</p>\r\n<p>For those of you that are interested in following my progress, I will create a blog shortly after this post and then edit to include its location.</p>\r\n<p>EDIT:<em> Blog can be found here (</em><a href=\"http://touchlessumlmodelling.blogspot.com/\"><em>http://touchlessumlmodelling.blogspot.com/</em></a><em>). For those of you that intend to read it, please keep in mind that I am required to maintain this blog by my&nbsp;university&nbsp;and that it is used for task and deadline definition and tracking and not a typical discussion type blog. This is also my first serious project and I have no way (or really idea) about how id go about hosting a Silverlight applications so that I can show demo's and progress to you guys or anyone outside localhost. &nbsp;I really would like to though but could only spend a maximum of &pound;5-7 a month to host it as i am student-poor.</em></p>\r\n<p>&nbsp;</p>\r\n<p>After playing around with the demo included along-side the SDK download, it is clear that while the SDK works well with large objects of a colour that is not abundant in the video's background, it cannot define marker locations accurately enough (with default settings) to facilitate respectable drag-and-drop functionality to GUI elements.</p>\r\n<p>However, if one fiddles with the Camera settings and turns the exposure right down so that the image on-screen is entirely black (although only just), and then points a TV remote control (with your finger held down on a button) at the camera, then you are able to define this source as a marker and draw on screen by moving the controller about quite fast and still it draws a continuous line. &nbsp;Ultimately I intend for the user of my application to wear a lightweight glove. I had originally thought that each finger could have a coloured L.E.D on each finger-tip but after playing with the demo app, I feel i will have to have each finger-tip giving out a specific frequency of IR light (or simply have control for turning each tip on/off) in order to get a finer level of control over moving the markers.</p>\r\n<p>&nbsp;</p>\r\n<p>So my first question to this community is, How can I set-up a Camera control panel to set the exposure of the camera to way below what would give a decent image to the human eye ? &nbsp;Would my Silverlight app need to adjust the image before sending it for processing to the TouchlessLib or is there a way of telling whatever is inside the Touchless code to look at the image with a reduced level of exposure ?</p>\r\n<p>&nbsp;</p>\r\n<p>FURTHER EDIT: <em>I have now spent some time playing around with SL4 and its webcam abilities. &nbsp;I thought id try and get (what was simple in Win Forms) a marker tracking demo up using SL4 and Touchless. &nbsp;Of course, a good starting point for this would be the demo app posted in a discussion <a title=here href=\"http://touchless.codeplex.com/Thread/View.aspx?ThreadId=75954\">here</a>. I downloaded and opened it and...well...I don't understand it. &nbsp;From looking at the code and google'ing some terms I think its an app built against a MVVM&nbsp;architecture, something very new and&nbsp;foreign to my simple MVP mind. &nbsp;Is this level of complexity really what is required to get Touchless' marker tracking over SL4 ? &nbsp;Or is there a more simple way. &nbsp;All that is really needed is a way of getting a </em>System.Windows.Media.CaptureSource<em>&nbsp;into a&nbsp;</em>TouchlessLib.Camera <em>and we're away right ?</em>&nbsp;<em>Then, all we need to do is get a Silverlight 4 Rectangle to fill with a </em>System.Drawing.Bitmap <em>pulled from </em>TouchlessManager<em>'s current camera and not the strange </em>WriteableBitmap<em> or </em>BitmapImage<em> SL4 insists on using.</em></p>\r\n<p>Thank you for your time on this matter and I look forward to working with the Touchless SDK.&nbsp;</p>",
    "PostedDate": "2010-02-17T16:19:24.1-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]